# Installation directory
cask_args appdir: '/Applications'

# Add necessary repositories
tap 'caskroom/homebrew-cask' || true

# Install brew packages
brew 'git'
brew 'acrogenesis/macchanger/macchanger'
brew 'nmap'
brew 'node@8'
brew 'nvm'
brew 'python'
brew 'terminal-notifier'
brew 'wget'

# Install applications via cask
cask '1password'
cask 'audiobookbinder'
cask 'bettertouchtool'
cask 'boostnote'
cask 'calibre'
cask 'docker'
cask 'dropbox'
cask 'git'
cask 'google-chrome'
cask 'grandperspective'
cask 'helium'
cask 'iterm2'
cask 'plex-media-player'
cask 'private-internet-access'
# cask 'spark'
cask 'spotify'
cask 'torbrowser'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'
